app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM "projects"

  def show
    @project = Project.find(params[:id]);
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "updated_at", "description", "archived", "created_at") VALUES('Blitz', '2010-08-05 00:09:21', 'Agile Management Software', 'f', '2010-08-05 00:09:21')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "name" = 'NTake - Properties', "updated_at" = '2010-07-31 15:38:36' WHERE "id" = 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 3)
DELETE FROM "projects" WHERE "id" = 3